tutorials/plastic_cases/fracture_wellbore_pressure/no_capillary_pressure/K6.7e-12U2.6Speed/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);

nonWetting 
{
    transportModel  Newtonian; 
    nu              [0 2 -1 0 0 0 0] 4e-6; 
    rho             [1 -3 0 0 0 0 0] 1250;
}

wetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-5; 
    rho             [1 -3 0 0 0 0 0] 1;
}

transportModel  HerschelBulkleyQuemada; 
   
    HerschelBulkleyQuemadaCoeffs
    {
	nu0      [ 0 2 -1 0 0 0 0 ] 1e05;      //for low strain rates use very viscous viscocity
        tau0     [ 0 2 -2 0 0 0 0 ] 2; //0.2 also works good
	epssMax  [ 0 0 0 0 0 0 0 ] 0.65;
        nuf        [ 0 2 -1 0 0 0 0 ] 1e-6;   //viscosity of water
	Dstar    [ 0 0 0 0 0 0 0 ] 1.1; //Dimension parameter
        n        [ 0 0 0 0 0 0 0 ] 1;         // Power law (if 1 its just Bingham model)
        m        [ 0 0 0 0 0 0 0 ] 0.4;  
	Beta     [ 0 0 0 0 0 0 0 ] 8;  
	//n==1 for newtonian slope. n>1 is shear thickeninng and n<1 is shear thinning. 
    }

//Solid Phase Stuff

activateSolidMechanics 1;
rho_s           [1 -3 0 0 0 0 0] 2650;  
epssMax         [ 0 0 0 0 0 0 0 ] 0.65;
Ppore           [1 -1 -2 0 0 0 0] 0; //Pore pressure about 10 atm
Pconf           [1 -1 -2 0 0 0 0] 0; //Contact stress from above    

//Two Phase Stuff

activateCapillarity            1;
activatePorousContactAngle     0;
theta0                         180;

sigma            [1 0 -2 0 0 0 0]  0.063;
invFk0           [0 -2 0 0 0 0 0]  4.88e6; // 12/(b^2)

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

relativePermeabilityModel  VanGenuchten;
capillarityModel           VanGenuchten;

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 0; //1e3
    m 0.05;
}

SolveWithUr        [0 0 0 0 0 0 0] 1; //500

variablePc         [0 0 0 0 0 0 0] 1; //500
// ************************************************************************* //
