tutorials/plastic_cases/fracture_wellbore_pressure/no_capillary_pressure/K6.7e-12U2.6Speed/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

inletFlowRatePos      2.6e-2;
inletFlowRateNeg     -2.6e-2;
inPressure           0;     //0 with fixedFluxPressure, X with totalPressure
velocityBC           fixedValue; //pressureInletVelocity 
porousVelocityBC     slip; //zeroGradient
pressureBC 	     fixedFluxPressure; // totalPressure;



// ************************************************************************* //
